# Creating an unmanaged (external) Spark table
This notebook describes how to create an unmanaged (also known as external) table from Spark. 
The table is created in /datalake/cities which may exist already (so you can attach to existing data) it can be created when you insert data.

In [9]:
CREATE TABLE cities
  (name STRING, population INT)
  USING PARQUET
  LOCATION '/datalake/cities'
  OPTIONS ('compression'='snappy')

Insert a few rows into the table using a list of values.

In [10]:
INSERT INTO cities VALUES ('Seattle', 730400), ('San Francisco', 881549), ('Beijing', 21540000), ('Bangalore', 10540000)

* Retrieve values back. Click on 'Chart' below to review the visualization.

In [11]:
SELECT * FROM cities ORDER BY name

Drop the table. Please note the data will remain in the data lake.

In [8]:
DROP TABLE cities